import logo from './logo.svg';
import './App.css';
import Header from './components/Header/Header';
import Shop from './components/Shop/Shop';

function App() {
  return (
    <div className="App">
      <Header></Header> 
      <Shop></Shop>
     <div className="question-container">
       <p>প্রস্নঃ রিয়াক্ট কিভাবে কাজ করে?</p>
       <p>উত্তরঃ রেয়াক্ট এর অন্যতম গুন হচ্ছে  এর সিমপ্লিসিটি। কোর জাভাস্ক্রিপ্ট রা পাশাপাশি JSX নামের স্পেসাল সিন্টেক্স ব্যাবহার করে জা আমাদের জাভাস্ক্রিপ্ট এর ভিতরে HTML লেখার সুবিধা দেয়। রিয়াক্ট লজিক অনুযায়ী কম্পনেন্ট নিজেরমত করে পরিবর্তন  করে নেয়। রিয়াক্ট সব সময় একমুখী উপরের থেকে নিচের দিকে ডাটা প্রবাহ করে থাকে। রিয়েক্ট এলিমেন্ট গুলোকে DOM এর মধ্যে রেন্ডারিং করতে JSX কাজ করে থাকে।</p>
       <p>প্রশ্নঃ useState কিভাবে কাজ করে ?</p>
       <p>উত্তরঃ useState হল রিয়াক্টের একটি ফাংশন যাকে বলা হয় Hook । useState একটি ইনিসিয়াল ভ্যালু  গ্রহন করে। useState দুইটি ভ্যালু রিটার্ন করে এবং ভ্যালু দুইটি একটি আয়্যারে টাইপের রিটার্ন হয়ে আসে যাহার মধ্যে দুইটি এলিমেন্ট থাকে। ১ম ইনডেক্স দ্বারা ইনিসিয়াল ভ্যালু ০ পাই। ২য় ইনডেক্স দ্বারা একটি ফাংশন পাই। এই ফাংশনের মাধ্যমে  state data update করা হয়।</p>
     </div>
    </div>
  );
}
 
export default App;
